app/Views/penyedia/index.php

SELECT *
FROM `barang`
INNER JOIN `penyedia` ON `barang`.`idpenyedia` = `penyedia`.`idpenyedia`
WHERE `barang`.`idpenyedia` = '158'
---
            <?php
            $idpenyedia = session('idpenyedia');
            $barangModel = new \App\Models\BarangModel;
            $data = $barangModel->join('penyedia', 'barang.idpenyedia = penyedia.idpenyedia', 'inner')->where('barang.idpenyedia', $idpenyedia)->get()->getResult();