app/Views/penyedia/pesanan.php

SELECT *
FROM `pesanan`
INNER JOIN `penyedia` ON `pesanan`.`idpenyedia` = `penyedia`.`idpenyedia`
INNER JOIN `penjual` ON `pesanan`.`idpenjual` = `penjual`.`idpenjual`
INNER JOIN `barang` ON `pesanan`.`idbarang` = `barang`.`idbarang`
WHERE `pesanan`.`idpenyedia` = '158'
---
                <tbody>
                    <?php
                    $pesananModel = new \App\Models\Pesanan;
                    $data = $pesananModel->join('penyedia', 'pesanan.idpenyedia = penyedia.idpenyedia', 'inner')->join('penjual', 'pesanan.idpenjual = penjual.idpenjual', 'inner')->join('barang', 'pesanan.idbarang = barang.idbarang', 'inner')->where(['pesanan.idpenyedia' => session('idpenyedia')])->get()->getResult();