app/Controllers/Login.php

    public function index()
    {
        $level = $this->request->getPost('level');
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        if ($level == 'admin') {
            $AdminModel = new \App\Models\Admin();
            $data = $AdminModel->where([
                'username' => $username,
                'password' => $password,
            ])->get()->getRow();
            session()->set('logged', 'YES');
            if ($data != NULL) {
                return redirect('admin/dashboard');
            } else {
                return redirect()->back();
            }
        } else if ($level == 'penjual') {
            $penjualModel = new \App\Models\Penjual();
            $data = $penjualModel->where([
                'plusername' => $username,
                'plpassword' => $password,
            ])->get()->getRow();
---
SELECT *
FROM `penjual`
WHERE `plusername` = 'admin'
AND `plpassword` = 'admin'

            }
        } else if ($level == 'penyedia') {
            $penyediaModel = new \App\Models\Penyedia();
            $data = $penyediaModel->where([
                'pyusername' => $username,
                'pypassword' => $password,
            ])->get()->getRow();
---
SELECT *
FROM `penyedia`
WHERE `pyusername` = 'penyedia'
AND `pypassword` = 'penyedia'