app/Controllers/Penjual.php

SELECT *
FROM `barang`
---
    public function index()
    {
        $barang = $this->barangModel->findAll();