app/Controllers/PenyediaController.php

UPDATE `pesanan` SET `statuspesanan` = 'Selesai'
WHERE `idpesanan` = '173'
---
    public function setStatus($id)
    {
        $row = $this->pesananModel->where(['idpesanan' => $id])->set([
            'statuspesanan' => $this->request->getPost('status')
        ])->update();