app/Views/penjual/Akun.php

SELECT *
FROM `penjual`
WHERE `idpenjual` = '129'
---
  <form action="<?= base_url('setAkun') ?>" method="post">
    <?php
    $penjualModel = new \App\Models\Penjual();
    $row = $penjualModel->where('idpenjual', session('idpenjual'))->get()->getRow();